#+TITLE: March 9-24, 2020 (16 days)
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 16
  :SPRINTSTART: <2020-03-09 Mon>
  :wpd-akshay196: 1
  :wpd-bhavin192: 1
  :wpd-gandalfdwite: 1
  :wpd-kurianbenoy: 1
  :END:
** akshay196
*** IN_PROGRESS Introduction to Operating Systems - Part III
    :PROPERTIES:
    :ESTIMATED: 16
    :ACTUAL:   1.62
    :OWNER: akshay196
    :ID: READ.1580485531
    :TASKID: READ.1580485531
    :END:
    :LOGBOOK:
    CLOCK: [2020-03-11 Wed 22:46]--[2020-03-11 Wed 23:07] =>  0:21
    CLOCK: [2020-03-11 Wed 05:55]--[2020-03-11 Wed 06:17] =>  0:22
    CLOCK: [2020-03-10 Tue 10:24]--[2020-03-10 Tue 11:18] =>  0:54
    :END:
    https://classroom.udacity.com/courses/ud923
    - [X] Inter-Process Communication           ( 90 min)
    - [ ] Syncronization Constructs             (180 min)
    - [ ] I/O Managements                       (120 min)
    - [ ] Virtualization                        (120 min)
    - [ ] Remote Procedure Calls                (180 min)
    - [ ] Distributed File System               (120 min)
    - [ ] Distributed Shared Memory             (180 min)

** bhavin192
*** Work on ingress-nginx issue #5005
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       DEV.1584037043
    :TASKID:   DEV.1584037043
    :END:
    https://github.com/kubernetes/ingress-nginx/issues/5005
*** Watch FOSDEM 2020 videos - Part I [0/18]
    :PROPERTIES:
    :ESTIMATED: 10
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       READ.1584036845
    :TASKID:   READ.1584036845
    :END:
    - [ ] [[https://fosdem.org/2020/schedule/event/fundamental_technologies_we_need_to_work_on_for_cloud_native_networking/][Fundamental Technologies We Need to Work on for Cloud-Native Networking]]        (50m)
    - [ ] [[https://fosdem.org/2020/schedule/event/tanka/][Introducing Tanka]]                                                              (30m)
    - [ ] [[https://fosdem.org/2020/schedule/event/beam_opentelemetry_xkcd_927_success_story/][OpenTelemetry: an XKCD 927 Success Story]]                                       (25m)
    - [ ] [[https://fosdem.org/2020/schedule/event/containers_live_migration/][Container Live Migration ]]                                                      (25m)
    - [ ] [[https://fosdem.org/2020/schedule/event/containers_syscall_emulation/][Supervising and emulating syscalls]]                                             (25m)
    - [ ] [[https://fosdem.org/2020/schedule/event/containers_k8s_runtimes/][Below Kubernetes: Demystifying container runtimes]]                              (25m)
    - [ ] [[https://fosdem.org/2020/schedule/event/riek_kubernetes/][How Containers and Kubernetes re-defined the GNU/Linux Operating System]]        (25m)
    - [ ] [[https://fosdem.org/2020/schedule/event/codeworkload/][Code Workload Management into the Control Plane]]                                (30m)
    - [ ] [[https://fosdem.org/2020/schedule/event/containers_memory_management/][Linux memory management at scale]]                                               (35m)
    - [ ] [[https://fosdem.org/2020/schedule/event/mysql_k8s/][Running MySQL in Kubernetes in real life]]                                       (25m)
    - [ ] [[https://fosdem.org/2020/schedule/event/security_secure_logging_with_syslog_ng/][Secure logging with syslog-ng]]                                                  (30m)
    - [ ] [[https://fosdem.org/2020/schedule/event/containers_lxd/][Running full Linux systems in containers, at scale]]                             (25m)
    - [ ] [[https://fosdem.org/2020/schedule/event/kubernetes/][Fixing the Kubernetes clusterfuck]]                                              (60m)
    - [ ] [[https://fosdem.org/2020/schedule/event/security_protecting_plaintext_secrets_in_configuration_files/][Protecting plaintext secrets in configuration files]]                            (30m)
    - [ ] [[https://fosdem.org/2020/schedule/event/containers_k8s_security/][How (Not) To Containerise Securely]]                                             (35m)
    - [ ] [[https://fosdem.org/2020/schedule/event/terraform/][Hacking Terraform for fun and profit]]                                           (30m)
    - [ ] [[https://fosdem.org/2020/schedule/event/containers_k8s_crio_lxc/][Using crio-lxc with Kubernetes]]                                                 (35m)
    - [ ] [[https://fosdem.org/2020/schedule/event/http3/][HTTP/3 for everyone]]                                                            (60m)

** gandalfdwite
*** Learning Terraform
    :PROPERTIES:
    :ESTIMATED: 12
    :ACTUAL:   1.02
    :OWNER: gandalfdwite
    :ID: OPS.1563198652
    :TASKID: OPS.1563198652
    :END:
    :LOGBOOK:
    CLOCK: [2020-03-11 Wed 23:49]--[2020-03-12 Thu 00:50] =>  1:01
    :END:
    - [ ] Introduction To Terraform   ( 2h )
    - [ ] Terraform CLI               ( 4h )
    - [ ] Terraform With AWS          ( 3h )
    - [ ] Terraform With Azure        ( 3h )
*** Learn OCaml for Emacs Bug Triaging
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:
    :OWNER: gandalfdwite
    :ID: READ.1580178290
    :TASKID: READ.1580178290
    :END:
    - [ ] Imperative Programming        ( 2h )
    - [ ] A complete Programme          ( 2h )
** kurianbenoy
*** Swift in Depth book - Part 1
   :PROPERTIES:
   :ESTIMATED: 7
   :ACTUAL:
   :OWNER: kurianbenoy
   :ID: READ.1583941789
   :TASKID: READ.1583941789
   :END:
   :LOGBOOK:
   CLOCK: [2020-03-16 Mon 14:54]--[2020-03-16 Mon 15:16] =>  0:22
   CLOCK: [2020-03-14 Sat 23:13]--[2020-03-15 Sun 00:06] =>  0:53
   CLOCK: [2020-03-14 Sat 21:28]--[2020-03-14 Sat 23:00] =>  1:32
   CLOCK: [2020-03-13 Fri 20:45]--[2020-03-13 Fri 22:08] =>  1:23
   :END:
   - [X] Hello World guide to swift
   - [ ] Modelling Data with Enums
   - [ ] Writing Cleaner Properties
*** Fluent Python
  :PROPERTIES:
   :ESTIMATED: 4
   :ACTUAL:
   :OWNER: kurianbenoy
   :ID: READ.1583941893
   :TASKID: READ.1583941893
   :END: 
  :LOGBOOK:
  CLOCK: [2020-03-15 Sun 22:37]--[2020-03-15 Sun 22:46] =>  0:09
  CLOCK: [2020-03-15 Sun 21:48]--[2020-03-15 Sun 22:19] =>  0:31
  CLOCK: [2020-03-13 Fri 00:24]--[2020-03-13 Fri 00:50] =>  0:26
  :END:
   - [X] Python Data Model
   - [ ] An array of sequences
*** Learn Emacs and modifying configs
   :PROPERTIES:
   :ESTIMATED: 5
   :ACTUAL:
   :OWNER: kurianbenoy
   :ID: DEV.1583941968
   :TASKID: DEV.1583941968
   :END:
   - [ ] Install Magit, watch and understand functionality
   - [ ] Modify Emacs config files
   - [ ] Python autocomplete IDE with emacs
   
